Tekla Open API Reference for Tekla Structures 2025
ViewBase.GetOriginalDrawing Method
 Gets the drawing on which the view was originally created. @see DrawingObject.GetDrawing() for retrieving the current drawing the object resides on.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Drawing GetOriginalDrawing()
Public Function GetOriginalDrawing As Drawing
Return Value
Type: Drawing
The drawing from which the view was made, or NULL if it is not from another drawing.
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace